#서식문자
# %c, s, d, f, .2f, 6d, s, -s
# 단일문자,문자열,정수,실수,소수점 2자리까지의 실수, 6자리 출력, 오른쪽, 왼쪽정렬 출력순.
# in Python -> {}, {},{},{:f},{:.2f},{:6},{:>}{:<}과 대응된다
""" 
print("%c%c" %("안","녕")) #c스타일
print("{}{}" .format("안","녕")) #파이썬 스타일
print("{}{}{}" .format("안","\n","녕",sep=""))
"""
"""
print("%s,%d"%("펭수",20))
print("{}님의 나이는\n{}입니다" .format("펭수",20))

print("%s님의 키는%f입니다"%("펭수",12.22314))
print("{}님의 키는{:.2f}입니다".format("펭수",12.234))
print("%d원\n%10d원"%(10000,200000))
print("{}원\n{:10}원".format(10000,200000))
 """
#git기능 공부하기, doft,hard,merge,cherrypick, checkout...,원격에푸시할분기를체크아웃하세요?
#c스타일
print("%10s"%("오른쪽 정렬"))
print("%-10s"%("왼쪽 정렬"))
print("%-10s,%10s"%("왼쪽정렬","오른쪽 정렬"))
#py 스타일
print("{:>10}".format("오른쪽 정렬"))
print("{:<10}".format("왼쪽 정렬"))
print("{:<10},{:>10}".format("왼쪽정렬","오른쪽 정렬"))
#여백 0으로 채우고 출력
print("%5d %05d"%(1,1))
print("{:5} {:05}".format(1,1))
#파이썬만 가능
print("{:>5}{:_>20}".format(1,10000000000)) #_자리에 다른문자를 넣으면 공백을 해당문자로 변환해서 출력함
print("{:,}원".format(1000000000))#:, 정수한정 1000단위구분하는기호 서식이 여러개면 ,를 제일마지막에 넣기 ":_>20," 처럼

print("{:10}".format("100"))#파이썬은 기본설정이 문자는 왼쪽,정수는 오른쪽정렬이다
print("{:10}".format(100))#서식문자 >로 정렬시에 정수는 오른쪽 정렬이 기본이기때문에 불변,문자열은 정렬변환
#영어,숫자=1byte, 한글:2byte 
#정렬기호 뜻 :>10 -> :서식문자, >오른쪽으로부터, 10 10칸을 할당한다



#예제 기본 ver
""" print("{:>32}".format("파이썬 쇼핑몰"))
print("{}".format("번호 : 1078718855"))
print("{}".format("주소 : 서울시 종로구 종로3가"))
print("{}".format("성명 : 김사장"))
print("{}".format("전화 : 070-1234-5678"))
print("{:-<64}".format("")) # print("-"*64)로도 가능했음
print("{:>8}{:>16}{:>12}{:>16}".format("품명","단가","수량","금액"))
#비트계산대신 \t로 간격 설정했어도 가능, 총길이를 지정하지 않았다면 탭이더 간편함
#탭사용하면 앞쪽 비트가 바뀌어도 거의 뒷간격이 동일함 탭1번당 칸수를 계산해서 사용가능
print("{:-<64}".format(""))
print("{:16}{:<16,}{:<16}{:>8,}".format(" 블루투스이어폰",85000,"1",85000))
print("{:>12}{:>17,}{:>11}{:>23,}".format("USB3.0 8G",8000,"1",8000))
#print("{:>14}\t\t{:6,}\t{:>4}\t{:>6,}".format("USB3.0 8G",8000,"1",8000))
print("{:-<64}".format(""))
print("{:32}{:29,}".format("소 계",93000))
print("{:-<64}".format(""))
print("{:32}{:27,}".format("청구금액",93000))
print("{:32}{:27,}".format("받은금액",100000))
print("{:32}{:27,}".format("거스름돈",7000))
print("{:-<64}".format("")) """

"""
#변수ver
print("{:>32}".format("파이썬 쇼핑몰"))
print("{}".format("번호 : 1078718855"))
print("{}".format("주소 : 서울시 종로구 종로3가"))
print("{}".format("성명 : 김사장"))
print("{}".format("전화 : 070-1234-5678"))
print("{:-<64}".format(""))
print("{:>8}{:>16}{:>12}{:>16}".format("품명","단가","수량","금액"))
print("{:-<64}".format(""))
bt=int(85000)
usb=int(8000)
print("{:16}{:<16,}{:<16}{:>8,}".format("블루투스이어폰",bt,"1",bt))
print("{:>12}{:>17,}{:>11}{:>23,}".format("USB3.0 8G",usb,"1",usb))
print("{:-<64}".format(""))
print("{:32}{:29,}".format("소 계",bt+usb))
print("{:-<64}".format(""))
print("{:32}{:27,}".format("청구금액",bt+usb))
total=int(100000)
print("{:32}{:27,}".format("받은금액",total))
print("{:32}{:27,}".format("거스름돈",total-bt+usb))
print("{:-<64}".format(""))
"""
